package com.akie.java;

/*
* 一、Java面向对象学习的三条主线：（第4-6章）
* 1、Java类及类成员：属性、方法、构造器；代码块、内部类
*
* 2、面向对象的三大特征：封装性、继承性、多态性（抽象性）
*
* 3、其它关键字：this、super、static、final、abstract、interface、package、import
*
* 二、"人把大象装进冰箱"
*
* 1、面向过程：          考虑怎么做
* （a）把冰箱门打开
* （b）把大象放进冰箱
* （c）关闭冰箱门
*
* 2、面向对象：          考虑谁来做
* 人{
*       打开（冰箱门）{
*           冰箱.打开
*               }
*       拿起（大象）{
*           大象.进入（冰箱）；
*               }
*       关闭（冰箱）{
*           冰箱.关闭（）；
*               }
*}
*
* 冰箱{
*   打开（）{}
*   关闭（）{}
* }
*
* 大象{
*       进入（冰箱）{
*       }
* }
*
*三、面向对象的两个要素：
* 类：对一类食物的描述，是抽象的、概念上的定义
* 对象：是实际存在的该类事物的每个个体，因而也称为实例（instance）
* >重点是类的设计
*
* */
public class OOPTest {
    public static void main(String[] args) {
        
    }
}
